fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CommonModules/ВКМ_ОбщийМодульВызовСервера/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ВКМ_ПечатьАктаОбОказанныхУслугах(МассивОбъектов) Экспорт
		
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_АктОказанныхУслуг";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ВКМ_ПФ_MXL_АктОказанныхУслуг");
	
	ДанныеДокументов = ВКМ_ПолучитьДанныеДокументов(МассивОбъектов);

	ПервыйДокумент = Истина;
	Пока ДанныеДокументов.Следующий() Цикл

		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
			
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьЗаголовок.Параметры.Заполнить(ДанныеДокументов);
		
		ДанныеПечати = Новый Структура;
		ДанныеПечати.Вставить("НомерДокумента", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокументов.Номер));
		ДанныеПечати.Вставить("ДатаДокумента", Формат(ДанныеДокументов.Дата, "ДЛФ=DD"));
		ДанныеПечати.Вставить("ДатаДоговора", Формат(ДанныеДокументов.ДатаДоговора, "ДФ=dd.MM.yyyy"));
	
		ОбластьЗаголовок.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
		
		ВыборкаУслуги = ДанныеДокументов.Услуги.Выбрать();
		Пока ВыборкаУслуги.Следующий() Цикл
			ОбластьСтрокаТаблицы.Параметры.Заполнить(ВыборкаУслуги);
			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
		КонецЦикла;
		
		ОбластьИтогПодвал = Макет.ПолучитьОбласть("ИтогПодвал");
		
		ИтогоПрописью = ЧислоПрописью(ДанныеДокументов.СуммаДокумента,"Л=ru_RU; ДП=Истина", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
	
		ДанныеПечати = Новый Структура;
		ДанныеПечати.Вставить("Итого", ДанныеДокументов.СуммаДокумента);
		ДанныеПечати.Вставить("ИтогоПрописью", ИтогоПрописью);

		ОбластьИтогПодвал.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьИтогПодвал);

	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ВКМ_ПолучитьДанныеДокументов(МассивОбъектов)
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	               |	РеализацияТоваровУслуг.Номер КАК Номер,
	               |	РеализацияТоваровУслуг.Дата КАК Дата,
	               |	РеализацияТоваровУслуг.Организация КАК Организация,
	               |	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	               |	РеализацияТоваровУслуг.Договор КАК Договор,
	               |	РеализацияТоваровУслуг.Договор.ВКМ_ДатаНачала КАК ДатаДоговора,
	               |	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	               |	РеализацияТоваровУслуг.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	РеализацияТоваровУслуг.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
				   |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	РеализацияТоваровУслуг.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Возврат Запрос.Выполнить().Выбрать();
		
КонецФункции

Процедура ВКМ_ВыполнитьАвтозаполнениеПоДоговору(Документ, Договор) Экспорт
    
    Отказ = Ложь;
    
    НоменклатураАбонентскаяПлата  = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
    НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
    
    Если Не ЗначениеЗаполнено(НоменклатураАбонентскаяПлата) Тогда
        ОбщегоНазначения.СообщитьПользователю("Значение константы Номенклатура абонентская плата не заполнено.",,,,Отказ);
    КонецЕсли;
    
    Если Не ЗначениеЗаполнено(НоменклатураРаботыСпециалиста) Тогда
        ОбщегоНазначения.СообщитьПользователю("Значение константы Номенклатура работы специалиста не заполнено.",,,,Отказ);
    КонецЕсли;
    
    Если Отказ Тогда
        Возврат;
    КонецЕсли;
    
    Документ.Товары.Очистить();
    Документ.Услуги.Очистить();
    
    ВКМ_ЕжемесячнаяАбонентскаяПлата = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВКМ_ЕжемесячнаяАбонентскаяПлата");
    
    Если ВКМ_ЕжемесячнаяАбонентскаяПлата <> 0 Тогда
        СтрокаТовара = Документ.Услуги.Добавить();
        СтрокаТовара.Номенклатура = НоменклатураАбонентскаяПлата;
        СтрокаТовара.Количество   = 1;
        СтрокаТовара.Цена         = ВКМ_ЕжемесячнаяАбонентскаяПлата;
        СтрокаТовара.Сумма        = ВКМ_ЕжемесячнаяАбонентскаяПлата;
    КонецЕсли;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
         "ВЫБРАТЬ
        |	СУММА(Обороты.СуммаКОплатеОборот) КАК СуммаКОплате
        |ИЗ
        |	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&НачалоМесяца, &КонецМесяца, , Договор = &Договор) КАК Обороты";
   
    Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Документ.Дата));
    Запрос.УстановитьПараметр("КонецМесяца",  КонецМесяца(Документ.Дата));
    Запрос.УстановитьПараметр("Договор",      Договор);
    
    Выборка = Запрос.Выполнить().Выбрать();
    
    Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.СуммаКОплате) Тогда
        Строка = Документ.Услуги.Добавить();
        Строка.Номенклатура = НоменклатураРаботыСпециалиста;
        Строка.Количество   = 1;
        Строка.Сумма        = Выборка.СуммаКОплате;
        Строка.Цена         = Выборка.СуммаКОплате;
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти
